Deep-Learning/MiMo-V2.5-Pro-on-MI300X-Benchmark/data/raw-logs/20260713-amd-tuned-moe-expanded-concurrency/points/dp2/benchmark_262144_out1_con2.log
/opt/venv/lib/python3.10/site-packages/transformers/modeling_rope_utils.py:1034: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=262144, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://<ip>:40000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=262144, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=2, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 8388608
#Output tokens: 32
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:20<10:40, 20.67s/it]
  6%|▋         | 2/32 [00:21<04:25,  8.85s/it]
  9%|▉         | 3/32 [00:41<06:44, 13.96s/it]
 12%|█▎        | 4/32 [00:41<03:59,  8.56s/it]
 16%|█▌        | 5/32 [01:01<05:45, 12.79s/it]
 19%|█▉        | 6/32 [01:02<03:43,  8.59s/it]
 22%|██▏       | 7/32 [01:22<05:11, 12.45s/it]
 25%|██▌       | 8/32 [01:22<03:24,  8.53s/it]
 28%|██▊       | 9/32 [01:43<04:45, 12.41s/it]
 34%|███▍      | 11/32 [02:04<04:00, 11.44s/it]
 38%|███▊      | 12/32 [02:04<02:52,  8.62s/it]
 41%|████      | 13/32 [02:25<03:44, 11.81s/it]
 44%|████▍     | 14/32 [02:25<02:35,  8.66s/it]
 47%|████▋     | 15/32 [02:46<03:23, 11.95s/it]
 50%|█████     | 16/32 [02:46<02:18,  8.69s/it]
 53%|█████▎    | 17/32 [03:06<03:00, 12.02s/it]
 56%|█████▋    | 18/32 [03:07<02:01,  8.69s/it]
 59%|█████▉    | 19/32 [03:27<02:35, 11.92s/it]
 62%|██████▎   | 20/32 [03:28<01:45,  8.81s/it]
 66%|██████▌   | 21/32 [03:47<02:11, 11.93s/it]
 69%|██████▉   | 22/32 [03:49<01:28,  8.88s/it]
 72%|███████▏  | 23/32 [04:08<01:48, 12.04s/it]
 75%|███████▌  | 24/32 [04:10<01:11,  8.91s/it]
 78%|███████▊  | 25/32 [04:29<01:23, 11.92s/it]
 81%|████████▏ | 26/32 [04:31<00:53,  8.85s/it]
 84%|████████▍ | 27/32 [04:49<00:58, 11.77s/it]
 88%|████████▊ | 28/32 [04:52<00:36,  9.01s/it]
 91%|█████████ | 29/32 [05:10<00:35, 11.77s/it]
 94%|█████████▍| 30/32 [05:13<00:18,  9.11s/it]
 97%|█████████▋| 31/32 [05:31<00:11, 11.84s/it]
100%|██████████| 32/32 [05:34<00:00,  9.19s/it]
100%|██████████| 32/32 [05:34<00:00, 10.46s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 2         
Successful requests:                     32        
Benchmark duration (s):                  334.69    
Total input tokens:                      8388608   
Total input text tokens:                 8388608   
Total generated tokens:                  32        
Total generated tokens (retokenized):    32        
Request throughput (req/s):              0.10      
Input token throughput (tok/s):          25063.73  
Output token throughput (tok/s):         0.10      
Peak output token throughput (tok/s):    2.00      
Peak concurrent requests:                4         
Total token throughput (tok/s):          25063.83  
Concurrency:                             1.99      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   20823.04  
Median E2E Latency (ms):                 20875.35  
P90 E2E Latency (ms):                    21158.95  
P95 E2E Latency (ms):                    21222.17  
P99 E2E Latency (ms):                    21238.68  
---------------Time to First Token----------------
Mean TTFT (ms):                          20823.01  
Median TTFT (ms):                        20875.32  
P90 TTFT (ms):                           21158.92  
P95 TTFT (ms):                           21222.15  
P99 TTFT (ms):                           21238.66  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P90 TPOT (ms):                           0.00      
P95 TPOT (ms):                           0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P90 ITL (ms):                            0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================